app/controllers/captures_controller.rb

  def index
    @captures = Capture.all
---
SELECT "captures".* FROM "captures"

  def create
    @capture = Capture.new(capture_params)

    respond_to do |format|
      if @capture.save
---
INSERT INTO "captures" ("title", "url", "created_at", "updated_at", "imgurl") VALUES (?, ?, ?, ?, ?)

  def destroy
    @capture.destroy
---
DELETE FROM "captures" WHERE "captures"."id" = ?  [["id", 1]]

    def set_capture
      @capture = Capture.find(params[:id])
---
SELECT  "captures".* FROM "captures" WHERE "captures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]